In [20]:
a = 5
a

5

In [21]:
b = a
b

5

In [22]:
b = b*2
b

10

In [23]:
a

5

In [5]:
import pandas as pd
import os
os.chdir('C:/Users/ruslan.bergenov/RD Local/Udacity-Machine-Learning-Introduction-Nanodegree/Deep Learning/2 Implementing Gradient Descent/8 Implementing Backpropagation')
os.getcwd()

'C:\\Users\\ruslan.bergenov\\RD Local\\Udacity-Machine-Learning-Introduction-Nanodegree\\Deep Learning\\2 Implementing Gradient Descent\\8 Implementing Backpropagation'

In [6]:
df_A = pd.read_csv('binary.csv')
df_A.head()

   admit  gre   gpa  rank
0      0  380  3.61     3
1      1  660  3.67     3
2      1  800  4.00     1
3      1  640  3.19     4
4      0  520  2.93     4

In [7]:
df_B = df_A
df_B.head()

   admit  gre   gpa  rank
0      0  380  3.61     3
1      1  660  3.67     3
2      1  800  4.00     1
3      1  640  3.19     4
4      0  520  2.93     4

In [8]:
del(df_B['rank'])
df_B.head()

   admit  gre   gpa
0      0  380  3.61
1      1  660  3.67
2      1  800  4.00
3      1  640  3.19
4      0  520  2.93

In [14]:
df_A.head()

   admit  gre   gpa  rank
0      0  380  3.61     3
1      1  660  3.67     3
2      1  800  4.00     1
3      1  640  3.19     4
4      0  520  2.93     4

In [15]:
df_A = pd.read_csv('binary.csv')
df_A.head()

   admit  gre   gpa  rank
0      0  380  3.61     3
1      1  660  3.67     3
2      1  800  4.00     1
3      1  640  3.19     4
4      0  520  2.93     4

In [16]:
df_B = df_A
df_B.head()

   admit  gre   gpa  rank
0      0  380  3.61     3
1      1  660  3.67     3
2      1  800  4.00     1
3      1  640  3.19     4
4      0  520  2.93     4

In [17]:
del(df_A['rank'])
df_A.head()

   admit  gre   gpa
0      0  380  3.61
1      1  660  3.67
2      1  800  4.00
3      1  640  3.19
4      0  520  2.93

In [19]:
df_B.head()

   admit  gre   gpa
0      0  380  3.61
1      1  660  3.67
2      1  800  4.00
3      1  640  3.19
4      0  520  2.93

In [10]:
df_A = pd.read_csv('binary.csv')
df_A.head()

   admit  gre   gpa  rank
0      0  380  3.61     3
1      1  660  3.67     3
2      1  800  4.00     1
3      1  640  3.19     4
4      0  520  2.93     4

In [11]:
df_B = df_A.copy()
df_B.head()

   admit  gre   gpa  rank
0      0  380  3.61     3
1      1  660  3.67     3
2      1  800  4.00     1
3      1  640  3.19     4
4      0  520  2.93     4

In [12]:
del(df_B['rank'])
df_B.head()

   admit  gre   gpa
0      0  380  3.61
1      1  660  3.67
2      1  800  4.00
3      1  640  3.19
4      0  520  2.93

In [13]:
df_A.head()

   admit  gre   gpa  rank
0      0  380  3.61     3
1      1  660  3.67     3
2      1  800  4.00     1
3      1  640  3.19     4
4      0  520  2.93     4